kasperskaarhoj/SKAARHOJ-Open-Engineering/SKAARDUINO/HardwareProfile/SKAARDUINO/avr/boards.txt
skaarduino.name=SKAARDUINO AVR

skaarduino.upload.tool=arduino:avrdude
skaarduino.upload.protocol=arduino
skaarduino.upload.maximum_data_size=16384
skaarduino.upload.maximum_size=130048
skaarduino.upload.speed=115200

skaarduino.bootloader.tool=arduino:avrdude
skaarduino.bootloader.low_fuses=0xf7
skaarduino.bootloader.high_fuses=0xde
skaarduino.bootloader.extended_fuses=0xfd
skaarduino.bootloader.file=optiboot/optiboot_1284p_20MHz_noled.hex
skaarduino.bootloader.unlock_bits=0x3F
skaarduino.bootloader.lock_bits=0x0F

skaarduino.build.mcu=atmega1284p
skaarduino.build.f_cpu=20000000L
skaarduino.build.core=arduino:arduino
skaarduino.build.variant=standard
skaarduino.build.board=SKAARDUINO_V1

